<template>
<div class="flex flex-wrap justify-around ">
  <div class="max-w-full px-3 shrink-0 xl:w-2/12 md:flex-0 md:mt-0">
    <div class="absolute"> 
    <div class="h-screen flex-col justify-between hidden xl:flex fixed w-80">
    <div class="">
      <div class="h-20"></div>
      <div class="bg-white dark:bg-slate-900 lg:rounded-2xl px-2 mx-3  py-4">
        <div class="text-xl font-bold mb-2">Условия и правила</div>
        <ul class="list-none list-inside text-slate-900 dark:text-slate-200">
            <li class="mb-3">
              <a href="#" class="text-blue-600 dark:text-white dark:hover:text-slate-400 hover:text-black">Условия использования</a>
            </li>
            <li class="mb-3">
              <a href="#" class="text-blue-600 dark:text-white dark:hover:text-slate-400 hover:text-black">Политика конфиденциальности</a>
            </li>

        </ul>          
      </div>
    
    </div>
    
      </div>
    </div>

  </div>
  <div class="w-full max-w-full px-3 mx-3 md:w-6/12 md:flex-0">
    <div class="bg-white dark:bg-slate-900 lg:rounded-2xl">
      <div class="text-2xl p-6">Условия и выходные данные</div>
      <div class="p-6">
        <div class="text-xl font-bold mb-2">Условия использования</div>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400">
          Добро пожаловать в {{ siteName }}!
        </p>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400">
          Настоящие Условия использования (далее — "Условия") регулируют использование вами {{ siteName }} (если прямо не указано, 
          что применяются отдельные условия, а не эти) и содержат информацию о Сервисе {{ siteName }} (далее — "Сервис"), 
          изложенную ниже. Создавая аккаунт {{ siteName }} или используя {{ siteName }}, вы принимаете настоящие условия.
        </p>

        <div class="text-xl font-bold mb-2">Сервис {{ siteName }}</div>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400">
          Мы соглашаемся предоставлять вам Сервис {{ siteName }}. 
          Сервис включает в себя все продукты, функции, приложения, сервисы, технологии и программное обеспечение {{ siteName }}, 
          которые мы предоставляем для выполнения миссии {{ siteName }} — помогать вам оставаться на связи 
          с важными для вас людьми и быть в курсе того, что вам интересно.
        </p>  
        <!-- Политика конфиденциальности -->
        
        <div class="text-xl font-bold mb-2">Ваши обязательства</div>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400 mb-3">
          В обмен на наше обязательство предоставлять 
          Сервис вы должны взять на себя следующие обязательства перед нами.
        </p>   
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400 mb-3">
          <span class="text-base font-bold">Кто может использовать {{ siteName }}.</span>
          Мы хотим, чтобы наш Сервис был максимально открытым и доступным для всех, 
          но вместе с тем безопасным, 
          защищенным и соответствующим требованиям законодательства. 
          Поэтому, чтобы стать частью сообщества {{ siteName }}, 
          вы должны соблюдать некоторые ограничения.
        </p>    
        <ul class="list-disc list-inside text-slate-900 dark:text-slate-200 ml-6">
          <li class="mb-3">Вам должно быть как минимум 13 лет.</li>
          <li class="mb-3">
            Вам не должно быть запрещено получать какой-либо 
            из компонентов нашего Сервиса в соответствии 
            с действующим законодательством или использовать 
            Сервисы, связанные с платежами, если вы входите в действующие списки запрещенных лиц.
          </li>
          <li class="mb-3">
            Ваш аккаунт не должен быть ранее отключен нами за нарушение законодательства или каких-либо наших правил.
          </li>
          <li class="mb-3">
            Вы не должны быть осуждены за совершение преступления на сексуальной почве. 
          </li>
        </ul>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400 mb-3">
          <span class="text-base font-bold">Запрещенные способы использования {{ siteName }}.</span>
          Предоставление безопасного и открытого Сервиса широкому сообществу требует, чтобы каждый из нас соблюдал правила.
        </p>    
        <ul class="list-disc list-inside text-slate-900 dark:text-slate-200 ml-6">
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">Вы не имеете права выдавать себя за других людей или предоставлять неточную информацию.</span>
            Вы не обязаны раскрывать свою личность в {{ siteName }}, но должны предоставить нам точную 
            и актуальную информацию (в том числе регистрационную), которая может включать персональные данные. 
            Кроме того, вы не имеете права выдавать себя за людей, которыми не являетесь, 
            или представлять компании, к которым не имеете отношения, а также создавать аккаунты 
            для других лиц без их прямого разрешения.
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
            Вы не имеете права совершать незаконные, 
            вводящие в заблуждение или обманные действия либо иные действия в незаконных или несанкционированных целях.          
            </span>
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права нарушать (а также помогать другим лицам или призывать их нарушать) настоящие Условия или наши правила.
            </span>
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права препятствовать нормальной работе Сервиса или вмешиваться в его работу.
            </span>
            Сюда относится ненадлежащее использование каналов для жалоб, споров и запросов на обжалование, 
            например отправка мошеннических или необоснованных жалоб либо запросов на обжалование.   
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права предпринимать попытки создания аккаунтов, 
              сбора информации или доступа к ней несанкционированными способами.
            </span> 
            Сюда относятся создание аккаунтов или сбор информации 
            с помощью автоматизированных средств без нашего прямого разрешения.
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права продавать, передавать по лицензии или покупать какие-либо аккаунты или данные, 
              полученные от нас или из нашего Сервиса.          
            </span>
            Сюда относятся попытки покупки, продажи или передачи каких-либо данных 
            вашего аккаунта (в том числе вашего имени пользователя), запроса, 
            сбора или использования учетных данных для входа или значков других пользователей, 
            а также запроса или сбора имен пользователей 
            и паролей в Instagram либо присвоения чужих маркеров доступа.
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права без разрешения публиковать личную 
              или конфиденциальную информацию пользователей или иным способом нарушать чьи-либо права, 
              в том числе права на интеллектуальную собственность 
              (например, путем нарушения авторского права, права на товарный знак, 
              распространения контрафактных или пиратских товаров).          
            </span>
            Вы вправе использовать чужие работы в соответствии 
            с исключениями или ограничениями в отношении авторского права и смежных прав, 
            предусмотренными применимым законодательством. Вы заверяете, что вы владеете контентом, 
            который публикуете или которым делитесь, либо получили на него все необходимые права.
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права изменять, переводить или реконструировать какие-либо наши продукты 
              или их компоненты либо пытаться создать производные работы на их основе.          
            </span>
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Вы не имеете права использовать в своем имени пользователя доменное имя или URL 
              без нашего предварительного письменного согласия.
            </span>
          </li>
        </ul>
        <p class="text-base leading-relaxed text-gray-500 dark:text-gray-400 mb-3">
          <span class="font-bold text-gray-500 dark:text-gray-400">Разрешения, которые вы предоставляете нам. </span>
          В рамках нашего соглашения вы также даете нам разрешения, 
          необходимые для предоставления Сервиса.
        </p>  
        <ul class="list-disc list-inside text-slate-900 dark:text-slate-200 ml-6">
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Мы не заявляем прав собственности на ваш контент, но вы даете нам лицензию на его использование.
            </span>       
            Ваши права на ваш контент остаются неизменными. 
            Мы не заявляем прав собственности на ваш контент, который вы публикуете в Сервисе или через него, 
            а вы вправе в любой момент делиться им с кем угодно. 
            Однако нам нужно получить от вас некоторые законные разрешения (именуемые "лицензией") 
            для предоставления Сервиса. Когда вы публикуете или загружаете контент, 
            являющийся объектом прав на интеллектуальную собственность (например, фото или видео), 
            в наш Сервис либо делитесь таким контентом или в связи с нашим Сервисом, 
            вы настоящим даете нам неисключительную, 
            действующую по всему миру лицензию с правом передачи и выдачи сублицензий на хранение, 
            использование, распространение, изменение, запуск, копирование, публичное исполнение или показ, 
            перевод вашего контента и создание производных работ 
            на его основе (в соответствии с вашими настройками конфиденциальности и приложения) 
            в целях предоставления Сервиса {{ siteName }}. Действие лицензии прекращается, 
            когда ваш контент удаляется из наших систем. 
            Вы можете удалять контент по отдельности или весь сразу, удалив свой аккаунт.
          </li>
          <li class="mb-3">
            <span class="font-bold text-gray-500 dark:text-gray-400">
              Использование вашего имени пользователя, 
              фото профиля и информации о ваших отношениях и действиях в связи с аккаунтами, 
              объявлениями и рекламным контентом.          
            </span>
            Ваше имя пользователя, фото профиля и информация о ваших действиях (например, отметках "Нравится") 
            или отношениях (например, подписках) могут использоваться рядом или в связи с аккаунтами, рекламой, 
            предложениями или другим спонсорским контентом, на которые вы подписываетесь или 
            с которыми вы взаимодействуете, демонстрируемыми в Продуктах Meta, 
            без выплаты вам какого-либо вознаграждения. Например, мы можем показывать информацию о том, 
            что вы поставили отметку "Нравится" спонсорской публикации, созданной брендом, 
            который заплатил нам за демонстрацию его рекламы в Instagram. 
            Как и в случае действий с другим контентом и подписками на другие аккаунты, 
            действия со спонсорским контентом и подписки на рекламные аккаунты могут видеть только люди, 
            которым вы разрешили видеть такой контент или подписки. 
            Мы также будем принимать во внимание ваши настройки рекламы.
          </li>
        </ul>
        <div class="text-xl font-bold mb-2">
          Дополнительные права, которые мы сохраняем за собой
        </div> 
        <ul class="list-disc list-inside text-slate-900 dark:text-slate-200 ml-6">
          <li class="mb-3">
            Если вы выбираете имя пользователя или аналогичный идентификатор для своего аккаунта, 
            мы оставляем за собой право изменить его, если сочтем это целесообразным или необходимым 
            (например, если оно нарушает чьи-либо права на интеллектуальную собственность 
            или если вы выдаете себя за другого пользователя).
          </li>
          <li class="mb-3">
            Если вы используете контент, являющийся объектом прав на интеллектуальную собственность, 
            имеющийся у нас и предоставляемый нами в нашем Сервисе (например, 
            при создании или публикации контента вы можете добавлять в него предоставляемые нами изображения, 
            оформление, видео или звуки), мы оставляем за собой все права на наш контент (но не на ваш контент)
          </li>
          <li class="mb-3">
            Вы можете использовать нашу интеллектуальную собственность и товарные знаки только 
            при наличии нашего предварительного письменного разрешения.
          </li>
          <li class="mb-3">
            Вы должны получить письменное разрешение у нас или разрешение в рамках открытой лицензии, 
            прежде чем изменять, создавать производные работы, 
            декомпилировать или пытаться иным образом получить от нас исходный код.
          </li>
        </ul>
      </div>
    </div>
  </div>
</div>
</template>

<script>
export default {
  name: 'PageRules',
  data(){
    return{
      siteName: import.meta.env.VITE_APP_NAME
    }
  },
  watch: {
    $route: {
      immediate: true,
      handler(to, from) {
          document.title = to.meta.title || 'Rules';
      }
    },
  },
}
</script>
<style>

</style>